Repository: atiliosud/vendsys-parser
Catalog: Backend/VendSysParser/Resources/Messages.*.resx
Languages: de_de, es_es, fi_fi, hu_hu, it_it, ja_jp, nl_nl, pt_br, sv_se, tr_tr

source: Authentication successful
de_de: Authentifizierung erfolgreich
es_es: Autenticación exitosa
fi_fi: Tunnistautuminen onnistui
hu_hu: Hitelesítés sikeres
it_it: Autenticazione riuscita
ja_jp: 認証に成功しました
nl_nl: Authenticatie succesvol
pt_br: Autenticação realizada com sucesso
sv_se: Autentisering lyckades
tr_tr: Kimlik doğrulama başarılı

# AuthenticationFailed
source: Authentication failed for user: {0}
de_de: Authentifizierung fehlgeschlagen für Benutzer: {0}
es_es: Fallo de autenticación para el usuario: {0}
fi_fi: Tunnistautuminen epäonnistui käyttäjälle: {0}
hu_hu: Hitelesítés sikertelen a felhasználóhoz: {0}
it_it: Autenticazione fallita per l'utente: {0}
ja_jp: ユーザーの認証に失敗しました: {0}
nl_nl: Authenticatie mislukt voor gebruiker: {0}
pt_br: Falha na autenticação para usuário: {0}
sv_se: Autentisering misslyckades för användare: {0}
tr_tr: Kullanıcı için kimlik doğrulama başarısız: {0}

# CredentialsValidationError
source: Error validating credentials for user: {0}
de_de: Fehler bei der Validierung der Anmeldedaten für Benutzer: {0}
es_es: Error validando credenciales para el usuario: {0}
fi_fi: Virhe käyttäjätunnusten validoinnissa käyttäjälle: {0}
hu_hu: Hiba a felhasználó hitelesítő adatainak validálásakor: {0}
it_it: Errore nella validazione delle credenziali per l'utente: {0}
ja_jp: ユーザーの資格情報の検証でエラーが発生しました: {0}
nl_nl: Fout bij het valideren van inloggegevens voor gebruiker: {0}
pt_br: Erro ao validar credenciais para usuário: {0}
sv_se: Fel vid validering av inloggningsuppgifter för användare: {0}
tr_tr: Kullanıcı için kimlik bilgileri doğrulama hatası: {0}

source: DEX file processed successfully
de_de: DEX-Datei erfolgreich verarbeitet
es_es: Archivo DEX procesado exitosamente
fi_fi: DEX-tiedosto käsitelty onnistuneesti
hu_hu: DEX fájl sikeresen feldolgozva
it_it: File DEX elaborato con successo
ja_jp: DEXファイルが正常に処理されました
nl_nl: DEX-bestand succesvol verwerkt
pt_br: Arquivo DEX processado com sucesso
sv_se: DEX-fil bearbetad framgångsrikt
tr_tr: DEX dosyası başarıyla işlendi

# DexFileUploadedSuccessfully
source: DEX file uploaded successfully. DexMeterId: {0}, FileName: {1}
de_de: DEX-Datei erfolgreich hochgeladen. DexMeterId: {0}, DateiName: {1}
es_es: Archivo DEX subido exitosamente. DexMeterId: {0}, NombreArchivo: {1}
fi_fi: DEX-tiedosto ladattu onnistuneesti. DexMeterId: {0}, TiedostoNimi: {1}
hu_hu: DEX fájl sikeresen feltöltve. DexMeterId: {0}, FájlNév: {1}
it_it: File DEX caricato con successo. DexMeterId: {0}, NomeFile: {1}
ja_jp: DEXファイルが正常にアップロードされました。DexMeterId: {0}, ファイル名: {1}
nl_nl: DEX-bestand succesvol ge√ºpload. DexMeterId: {0}, BestandsNaam: {1}
pt_br: Arquivo DEX enviado com sucesso. DEXMeterId: {0}, NomeArquivo: {1}
sv_se: DEX-fil uppladdad framgångsrikt. DexMeterId: {0}, Filnamn: {1}
tr_tr: DEX dosyası başarıyla yüklendi. DexMeterId: {0}, DosyaAdı: {1}

source: Error processing DEX file
de_de: Fehler beim Verarbeiten der DEX-Datei
es_es: Error procesando archivo DEX
fi_fi: Virhe DEX-tiedoston käsittelyssä
hu_hu: Hiba a DEX fájl feldolgozásakor
it_it: Errore nell'elaborazione del file DEX
ja_jp: DEXファイルの処理中にエラーが発生しました
nl_nl: Fout bij het verwerken van DEX-bestand
pt_br: Erro ao processar arquivo DEX
sv_se: Fel vid bearbetning av DEX-fil
tr_tr: DEX dosyası işlenirken hata

source: Error processing DEX file upload
de_de: Fehler beim Verarbeiten des DEX-Datei-Uploads
es_es: Error procesando la subida del archivo DEX
fi_fi: Virhe DEX-tiedoston latauksen käsittelyssä
hu_hu: Hiba a DEX fájl feltöltés feldolgozásakor
it_it: Errore nell'elaborazione del caricamento del file DEX
ja_jp: DEXファイルのアップロード処理中にエラーが発生しました
nl_nl: Fout bij het verwerken van DEX-bestand upload
pt_br: Erro ao processar envio do arquivo DEX
sv_se: Fel vid bearbetning av DEX-filuppladdning
tr_tr: DEX dosyası yüklemesi işlenirken hata

source: Request must be multipart/form-data
de_de: Anfrage muss multipart/form-data sein
es_es: La solicitud debe ser multipart/form-data
fi_fi: Pyynnön on oltava multipart/form-data
hu_hu: A kérésnek multipart/form-data típusúnak kell lennie
it_it: La richiesta deve essere multipart/form-data
ja_jp: リクエストはmultipart/form-dataである必要があります
nl_nl: Verzoek moet multipart/form-data zijn
pt_br: Requisição deve ser multipart/form-data
sv_se: Förfrågan måste vara multipart/form-data
tr_tr: İstek multipart/form-data olmalıdır

# NoFileProvidedOrEmpty
source: No file provided or file is empty
de_de: Keine Datei bereitgestellt oder Datei ist leer
es_es: No se proporcionó archivo o el archivo está vacío
fi_fi: Tiedostoa ei toimitettu tai tiedosto on tyhjä
hu_hu: Nincs fájl megadva vagy a fájl üres
it_it: Nessun file fornito o file vuoto
ja_jp: ファイルが提供されていないか、ファイルが空です
nl_nl: Geen bestand opgegeven of bestand is leeg
pt_br: Nenhum arquivo fornecido ou arquivo está vazio
sv_se: Ingen fil tillhandahållen eller filen är tom
tr_tr: Dosya sağlanmadı veya dosya boş

# InvalidFileType
source: Invalid file type. Allowed types: {0}
de_de: Ungültiger Dateityp. Erlaubte Typen: {0}
es_es: Tipo de archivo inválido. Tipos permitidos: {0}
fi_fi: Virheellinen tiedostotyyppi. Sallitut tyypit: {0}
hu_hu: Érvénytelen fájltípus. Engedélyezett típusok: {0}
it_it: Tipo di file non valido. Tipi consentiti: {0}
ja_jp: 無効なファイルタイプです。許可されているタイプ: {0}
nl_nl: Ongeldig bestandstype. Toegestane types: {0}
pt_br: Tipo de arquivo inválido. Tipos permitidos: {0}
sv_se: Ogiltigt filformat. Tillåtna format: {0}
tr_tr: Geçersiz dosya türü. İzin verilen türler: {0}

source: File content is empty
de_de: Dateiinhalt ist leer
es_es: El contenido del archivo está vacío
fi_fi: Tiedoston sisältö on tyhjä
hu_hu: A fájl tartalma üres
it_it: Il contenuto del file è vuoto
ja_jp: ファイルの内容が空です
nl_nl: Bestandsinhoud is leeg
pt_br: Conteúdo do arquivo está vazio
sv_se: Filinnehållet är tomt
tr_tr: Dosya içeriği boş

# DatabaseConnectionNotConfigured
source: Database connection string not configured
de_de: Datenbankverbindungsstring nicht konfiguriert
es_es: Cadena de conexión de base de datos no configurada
fi_fi: Tietokannan yhteysmerkkijonoa ei ole määritetty
hu_hu: Adatbázis kapcsolati sztring nincs konfigurálva
it_it: Stringa di connessione al database non configurata
ja_jp: データベース接続文字列が構成されていません
nl_nl: Database verbindingsstring niet geconfigureerd
pt_br: String de conexão com banco de dados não configurada
sv_se: Databasanslutningssträng inte konfigurerad
tr_tr: Veritabanı bağlantı dizesi yapılandırılmamış

# AnErrorOccurredProcessingDexFile
source: An error occurred processing the DEX file
de_de: Ein Fehler ist beim Verarbeiten der DEX-Datei aufgetreten
es_es: Ocurrió un error procesando el archivo DEX
fi_fi: Virhe tapahtui DEX-tiedoston käsittelyssä
hu_hu: Hiba történt a DEX fájl feldolgozásakor
it_it: Si è verificato un errore nell'elaborazione del file DEX
ja_jp: DEXファイルの処理中にエラーが発生しました
nl_nl: Er is een fout opgetreden bij het verwerken van het DEX-bestand
pt_br: Ocorreu um erro ao processar o arquivo DEX
sv_se: Ett fel uppstod vid bearbetning av DEX-filen
tr_tr: DEX dosyası işlenirken bir hata oluştu

# ID1SegmentNotFound
source: ID1 segment not found in DEX file
de_de: ID1-Segment in DEX-Datei nicht gefunden
es_es: Segmento ID1 no encontrado en el archivo DEX
fi_fi: ID1-segmenttiä ei löytynyt DEX-tiedostosta
hu_hu: ID1 szegmens nem található a DEX fájlban
it_it: Segmento ID1 non trovato nel file DEX
ja_jp: DEXファイル内でID1セグメントが見つかりません
nl_nl: ID1-segment niet gevonden in DEX-bestand
pt_br: Segmento ID1 não encontrado no arquivo DEX
sv_se: ID1-segment hittades inte i DEX-filen
tr_tr: DEX dosyasında ID1 segmenti bulunamadı

source: Invalid ID1 segment format
de_de: Ungültiges ID1-Segment-Format
es_es: Formato de segmento ID1 inválido
fi_fi: Virheellinen ID1-segmentin muoto
hu_hu: Érvénytelen ID1 szegmens formátum
it_it: Formato del segmento ID1 non valido
ja_jp: 無効なID1セグメント形式です
nl_nl: Ongeldig ID1-segment formaat
pt_br: Formato do segmento ID1 inválido
sv_se: Ogiltigt ID1-segmentformat
tr_tr: Geçersiz ID1 segment formatı

# VA1SegmentNotFound
source: VA1 segment not found in DEX file
de_de: VA1-Segment in DEX-Datei nicht gefunden
es_es: Segmento VA1 no encontrado en el archivo DEX
fi_fi: VA1-segmenttiä ei löytynyt DEX-tiedostosta
hu_hu: VA1 szegmens nem található a DEX fájlban
it_it: Segmento VA1 non trovato nel file DEX
ja_jp: DEXファイル内でVA1セグメントが見つかりません
nl_nl: VA1-segment niet gevonden in DEX-bestand
pt_br: Segmento VA1 não encontrado no arquivo DEX
sv_se: VA1-segment hittades inte i DEX-filen
tr_tr: DEX dosyasında VA1 segmenti bulunamadı

source: Invalid VA1 segment format
de_de: Ungültiges VA1-Segment-Format
es_es: Formato de segmento VA1 inválido
fi_fi: Virheellinen VA1-segmentin muoto
hu_hu: Érvénytelen VA1 szegmens formátum
it_it: Formato del segmento VA1 non valido
ja_jp: 無効なVA1セグメント形式です
nl_nl: Ongeldig VA1-segment formaat
pt_br: Formato do segmento VA1 inválido
sv_se: Ogiltigt VA1-segmentformat
tr_tr: Geçersiz VA1 segment formatı

# InvalidVA101Value
source: Invalid VA101 value: {0}
de_de: Ungültiger VA101-Wert: {0}
es_es: Valor VA101 inválido: {0}
fi_fi: Virheellinen VA101-arvo: {0}
hu_hu: Érvénytelen VA101 érték: {0}
it_it: Valore VA101 non valido: {0}
ja_jp: 無効なVA101値です: {0}
nl_nl: Ongeldige VA101-waarde: {0}
pt_br: Valor VA101 inválido: {0}
sv_se: Ogiltigt VA101-värde: {0}
tr_tr: Geçersiz VA101 değeri: {0}
